; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=207, out_folder=./training, instance_id=29, seed=2053, goal_proportion=0.03

(define (problem blocksworld-29)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 - object)
 (:init 
    (arm-empty)
    (clear b164)
    (on b164 b79)
    (on b79 b137)
    (on-table b137)
    (clear b186)
    (on b186 b21)
    (on b21 b85)
    (on b85 b103)
    (on b103 b2)
    (on b2 b1)
    (on b1 b76)
    (on b76 b194)
    (on b194 b69)
    (on b69 b62)
    (on b62 b129)
    (on-table b129)
    (clear b87)
    (on b87 b150)
    (on b150 b27)
    (on b27 b135)
    (on b135 b165)
    (on b165 b13)
    (on b13 b121)
    (on b121 b88)
    (on b88 b100)
    (on b100 b48)
    (on b48 b197)
    (on b197 b160)
    (on-table b160)
    (clear b144)
    (on b144 b98)
    (on b98 b86)
    (on b86 b46)
    (on b46 b149)
    (on b149 b81)
    (on b81 b156)
    (on b156 b118)
    (on b118 b5)
    (on-table b5)
    (clear b112)
    (on-table b112)
    (clear b171)
    (on b171 b67)
    (on b67 b94)
    (on b94 b74)
    (on b74 b96)
    (on-table b96)
    (clear b126)
    (on b126 b181)
    (on b181 b114)
    (on b114 b34)
    (on b34 b168)
    (on b168 b200)
    (on-table b200)
    (clear b91)
    (on b91 b172)
    (on b172 b9)
    (on-table b9)
    (clear b142)
    (on b142 b134)
    (on b134 b42)
    (on b42 b175)
    (on b175 b83)
    (on b83 b116)
    (on-table b116)
    (clear b8)
    (on b8 b102)
    (on-table b102)
    (clear b162)
    (on b162 b173)
    (on b173 b58)
    (on b58 b101)
    (on-table b101)
    (clear b203)
    (on b203 b110)
    (on b110 b155)
    (on b155 b202)
    (on b202 b127)
    (on b127 b161)
    (on-table b161)
    (clear b84)
    (on b84 b64)
    (on-table b64)
    (clear b123)
    (on-table b123)
    (clear b93)
    (on-table b93)
    (clear b43)
    (on-table b43)
    (clear b52)
    (on b52 b182)
    (on-table b182)
    (clear b92)
    (on b92 b205)
    (on b205 b99)
    (on b99 b199)
    (on b199 b97)
    (on-table b97)
    (clear b178)
    (on-table b178)
    (clear b53)
    (on b53 b36)
    (on b36 b63)
    (on b63 b148)
    (on b148 b14)
    (on b14 b82)
    (on-table b82)
    (clear b47)
    (on b47 b113)
    (on-table b113)
    (clear b38)
    (on-table b38)
    (clear b90)
    (on-table b90)
    (clear b40)
    (on b40 b71)
    (on b71 b179)
    (on-table b179)
    (clear b7)
    (on b7 b152)
    (on b152 b109)
    (on b109 b26)
    (on b26 b206)
    (on b206 b18)
    (on b18 b56)
    (on b56 b157)
    (on b157 b183)
    (on-table b183)
    (clear b104)
    (on b104 b72)
    (on b72 b147)
    (on b147 b158)
    (on-table b158)
    (clear b54)
    (on-table b54)
    (clear b115)
    (on b115 b177)
    (on b177 b44)
    (on-table b44)
    (clear b193)
    (on-table b193)
    (clear b60)
    (on b60 b143)
    (on b143 b107)
    (on b107 b11)
    (on b11 b176)
    (on-table b176)
    (clear b6)
    (on b6 b111)
    (on b111 b153)
    (on-table b153)
    (clear b195)
    (on b195 b105)
    (on b105 b196)
    (on b196 b49)
    (on b49 b16)
    (on b16 b185)
    (on b185 b170)
    (on b170 b24)
    (on b24 b169)
    (on b169 b59)
    (on-table b59)
    (clear b204)
    (on-table b204)
    (clear b119)
    (on b119 b117)
    (on-table b117)
    (clear b31)
    (on-table b31)
    (clear b12)
    (on b12 b189)
    (on b189 b136)
    (on b136 b61)
    (on b61 b45)
    (on-table b45)
    (clear b41)
    (on b41 b180)
    (on b180 b131)
    (on b131 b154)
    (on b154 b141)
    (on b141 b106)
    (on b106 b32)
    (on b32 b78)
    (on-table b78)
    (clear b89)
    (on b89 b55)
    (on-table b55)
    (clear b19)
    (on b19 b133)
    (on b133 b25)
    (on b25 b145)
    (on b145 b29)
    (on b29 b130)
    (on b130 b95)
    (on b95 b23)
    (on-table b23)
    (clear b201)
    (on b201 b108)
    (on b108 b80)
    (on b80 b184)
    (on-table b184)
    (clear b15)
    (on b15 b124)
    (on b124 b139)
    (on b139 b17)
    (on b17 b120)
    (on b120 b187)
    (on b187 b191)
    (on-table b191)
    (clear b151)
    (on b151 b128)
    (on b128 b159)
    (on b159 b190)
    (on b190 b77)
    (on b77 b3)
    (on b3 b28)
    (on b28 b33)
    (on b33 b20)
    (on-table b20)
    (clear b39)
    (on b39 b73)
    (on b73 b207)
    (on b207 b166)
    (on b166 b70)
    (on b70 b37)
    (on b37 b132)
    (on b132 b167)
    (on b167 b57)
    (on b57 b50)
    (on b50 b68)
    (on b68 b22)
    (on b22 b4)
    (on b4 b163)
    (on-table b163)
    (clear b140)
    (on-table b140)
    (clear b122)
    (on b122 b65)
    (on b65 b30)
    (on-table b30)
    (clear b138)
    (on b138 b174)
    (on b174 b125)
    (on b125 b192)
    (on b192 b188)
    (on b188 b51)
    (on b51 b35)
    (on-table b35)
    (clear b10)
    (on-table b10)
    (clear b66)
    (on-table b66)
    (clear b198)
    (on b198 b146)
    (on-table b146)
    (clear b75)
    (on-table b75))
 (:goal  (and 
    (clear b1)
    (on b1 b3)
    (on b3 b5)
    (on-table b5)
    (clear b4)
    (on b4 b2)
    (on b2 b6)
    (on-table b6))))

; plan
1. (unstack b6 b111)
   deleted: (on b6 b111) (clear b6) (arm-empty)
   added: (holding b6) (clear b111)
   goals met: 1 of 8
2. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 8
3. (unstack b144 b98)
   deleted: (on b144 b98) (clear b144) (arm-empty)
   added: (holding b144) (clear b98)
   goals met: 2 of 8
4. (putdown b144)
   deleted: (holding b144)
   added: (clear b144) (arm-empty) (on-table b144)
   goals met: 2 of 8
5. (unstack b151 b128)
   deleted: (on b151 b128) (clear b151) (arm-empty)
   added: (holding b151) (clear b128)
   goals met: 2 of 8
6. (putdown b151)
   deleted: (holding b151)
   added: (clear b151) (arm-empty) (on-table b151)
   goals met: 2 of 8
7. (unstack b128 b159)
   deleted: (on b128 b159) (clear b128) (arm-empty)
   added: (holding b128) (clear b159)
   goals met: 2 of 8
8. (putdown b128)
   deleted: (holding b128)
   added: (clear b128) (arm-empty) (on-table b128)
   goals met: 2 of 8
9. (unstack b159 b190)
   deleted: (on b159 b190) (clear b159) (arm-empty)
   added: (holding b159) (clear b190)
   goals met: 2 of 8
10. (putdown b159)
   deleted: (holding b159)
   added: (clear b159) (arm-empty) (on-table b159)
   goals met: 2 of 8
11. (unstack b186 b21)
   deleted: (on b186 b21) (clear b186) (arm-empty)
   added: (holding b186) (clear b21)
   goals met: 2 of 8
12. (putdown b186)
   deleted: (holding b186)
   added: (clear b186) (arm-empty) (on-table b186)
   goals met: 2 of 8
13. (unstack b190 b77)
   deleted: (on b190 b77) (clear b190) (arm-empty)
   added: (holding b190) (clear b77)
   goals met: 2 of 8
14. (putdown b190)
   deleted: (holding b190)
   added: (clear b190) (arm-empty) (on-table b190)
   goals met: 2 of 8
15. (unstack b21 b85)
   deleted: (on b21 b85) (clear b21) (arm-empty)
   added: (holding b21) (clear b85)
   goals met: 2 of 8
16. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 2 of 8
17. (unstack b39 b73)
   deleted: (on b39 b73) (clear b39) (arm-empty)
   added: (holding b39) (clear b73)
   goals met: 2 of 8
18. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 2 of 8
19. (unstack b73 b207)
   deleted: (on b73 b207) (clear b73) (arm-empty)
   added: (holding b73) (clear b207)
   goals met: 2 of 8
20. (putdown b73)
   deleted: (holding b73)
   added: (clear b73) (arm-empty) (on-table b73)
   goals met: 2 of 8
21. (unstack b207 b166)
   deleted: (on b207 b166) (clear b207) (arm-empty)
   added: (holding b207) (clear b166)
   goals met: 2 of 8
22. (putdown b207)
   deleted: (holding b207)
   added: (clear b207) (arm-empty) (on-table b207)
   goals met: 2 of 8
23. (unstack b166 b70)
   deleted: (on b166 b70) (clear b166) (arm-empty)
   added: (holding b166) (clear b70)
   goals met: 2 of 8
24. (putdown b166)
   deleted: (holding b166)
   added: (clear b166) (arm-empty) (on-table b166)
   goals met: 2 of 8
25. (unstack b70 b37)
   deleted: (on b70 b37) (clear b70) (arm-empty)
   added: (holding b70) (clear b37)
   goals met: 2 of 8
26. (putdown b70)
   deleted: (holding b70)
   added: (clear b70) (arm-empty) (on-table b70)
   goals met: 2 of 8
27. (unstack b37 b132)
   deleted: (on b37 b132) (clear b37) (arm-empty)
   added: (holding b37) (clear b132)
   goals met: 2 of 8
28. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 2 of 8
29. (unstack b132 b167)
   deleted: (on b132 b167) (clear b132) (arm-empty)
   added: (holding b132) (clear b167)
   goals met: 2 of 8
30. (putdown b132)
   deleted: (holding b132)
   added: (clear b132) (arm-empty) (on-table b132)
   goals met: 2 of 8
31. (unstack b167 b57)
   deleted: (on b167 b57) (clear b167) (arm-empty)
   added: (holding b167) (clear b57)
   goals met: 2 of 8
32. (putdown b167)
   deleted: (holding b167)
   added: (clear b167) (arm-empty) (on-table b167)
   goals met: 2 of 8
33. (unstack b57 b50)
   deleted: (on b57 b50) (clear b57) (arm-empty)
   added: (holding b57) (clear b50)
   goals met: 2 of 8
34. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 2 of 8
35. (unstack b50 b68)
   deleted: (on b50 b68) (clear b50) (arm-empty)
   added: (holding b50) (clear b68)
   goals met: 2 of 8
36. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 2 of 8
37. (unstack b68 b22)
   deleted: (on b68 b22) (clear b68) (arm-empty)
   added: (holding b68) (clear b22)
   goals met: 2 of 8
38. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 2 of 8
39. (unstack b22 b4)
   deleted: (on b22 b4) (clear b22) (arm-empty)
   added: (holding b22) (clear b4)
   goals met: 3 of 8
40. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 3 of 8
41. (unstack b77 b3)
   deleted: (on b77 b3) (clear b77) (arm-empty)
   added: (holding b77) (clear b3)
   goals met: 3 of 8
42. (putdown b77)
   deleted: (holding b77)
   added: (clear b77) (arm-empty) (on-table b77)
   goals met: 3 of 8
43. (unstack b85 b103)
   deleted: (on b85 b103) (clear b85) (arm-empty)
   added: (holding b85) (clear b103)
   goals met: 3 of 8
44. (putdown b85)
   deleted: (holding b85)
   added: (clear b85) (arm-empty) (on-table b85)
   goals met: 3 of 8
45. (unstack b103 b2)
   deleted: (on b103 b2) (clear b103) (arm-empty)
   added: (holding b103) (clear b2)
   goals met: 3 of 8
46. (putdown b103)
   deleted: (holding b103)
   added: (clear b103) (arm-empty) (on-table b103)
   goals met: 3 of 8
47. (unstack b98 b86)
   deleted: (on b98 b86) (clear b98) (arm-empty)
   added: (holding b98) (clear b86)
   goals met: 3 of 8
48. (putdown b98)
   deleted: (holding b98)
   added: (clear b98) (arm-empty) (on-table b98)
   goals met: 3 of 8
49. (unstack b86 b46)
   deleted: (on b86 b46) (clear b86) (arm-empty)
   added: (holding b86) (clear b46)
   goals met: 3 of 8
50. (putdown b86)
   deleted: (holding b86)
   added: (clear b86) (arm-empty) (on-table b86)
   goals met: 3 of 8
51. (unstack b46 b149)
   deleted: (on b46 b149) (clear b46) (arm-empty)
   added: (holding b46) (clear b149)
   goals met: 3 of 8
52. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 3 of 8
53. (unstack b149 b81)
   deleted: (on b149 b81) (clear b149) (arm-empty)
   added: (holding b149) (clear b81)
   goals met: 3 of 8
54. (putdown b149)
   deleted: (holding b149)
   added: (clear b149) (arm-empty) (on-table b149)
   goals met: 3 of 8
55. (unstack b81 b156)
   deleted: (on b81 b156) (clear b81) (arm-empty)
   added: (holding b81) (clear b156)
   goals met: 3 of 8
56. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 3 of 8
57. (unstack b156 b118)
   deleted: (on b156 b118) (clear b156) (arm-empty)
   added: (holding b156) (clear b118)
   goals met: 3 of 8
58. (putdown b156)
   deleted: (holding b156)
   added: (clear b156) (arm-empty) (on-table b156)
   goals met: 3 of 8
59. (unstack b118 b5)
   deleted: (on b118 b5) (clear b118) (arm-empty)
   added: (holding b118) (clear b5)
   goals met: 3 of 8
60. (putdown b118)
   deleted: (holding b118)
   added: (clear b118) (arm-empty) (on-table b118)
   goals met: 3 of 8
61. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 4 of 8
62. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 5 of 8
63. (unstack b3 b28)
   deleted: (on b3 b28) (clear b3) (arm-empty)
   added: (holding b3) (clear b28)
   goals met: 5 of 8
64. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 6 of 8
65. (unstack b1 b76)
   deleted: (on b1 b76) (clear b1) (arm-empty)
   added: (holding b1) (clear b76)
   goals met: 5 of 8
66. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 7 of 8
67. (unstack b4 b163)
   deleted: (on b4 b163) (clear b4) (arm-empty)
   added: (holding b4) (clear b163)
   goals met: 6 of 8
68. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 8 of 8
